import { useState } from "react";

function Azkar() {
  let azkarData = [
    {
      id: "1",
      data: " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      number: "1",
    },
    {
      id: "2",
      data: "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ(3 مرات)",
      number: "3",
    },
    {
      id: "3",
      data: "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(3 مرات) ",
      number: "3",
    },
    {
      id: "4",
      data: "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ(3 مرات)",
      number: "3",
    },
    {
      id: "5",
      data: "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ",
      number: "1",
    },
    {
      id: "6",
      data: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
      number: "1",
    },
    {
      id: "7",
      data: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.(3 مرات)",
      number: "3",
    },
    {
      id: "8",
      data: "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك(4 مرات)",
      number: "4",
    },
    {
      id: "9",
      data: "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      number: "1",
    },
    {
      id: "10",
      data: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.(7 مرات)",
      number: "7",
    },
    {
      id: "11",
      data: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم(3 مرات)",
      number: "3",
    },
    {
      id: "12",
      data: "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      number: "1",
    },
    {
      id: "13",
      data: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه(3 مرات)",
      number: "3",
    },
    {
      id: "14",
      data: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.  اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ(3 مرات)",
      number: "3",
    },
    {
      id: "15",
      data: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      number: "1",
    },
    {
      id: "16",
      data: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق(3 مرات)",
      number: "3",
    },
    {
      id: "17",
      data: "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.(10 مرات)",
      number: "10",
    },
    {
      id: "18",
      data: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ(100 مرة)",
      number: "100",
    },
    {
      id: "19",
      data: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.(100 مرة)",
      number: "100",
    },
    {
      id: "20",
      data: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ(100 مرة)",
      number: "100",
    },
  ];

  let [counter, setCounter] = useState(0);
  let [count, setCount] = useState(0);

  function num() {
    if (count < azkarData[counter].number - 1) {
      setCount(count + 1);
    } else if (counter === 19 && count === 99) {
      return; // Stop incrementing count at 100 for the 19th state
    } else {
      next();
    }
  }

  function next() {
    if (counter >= azkarData.length - 1) {
      setCounter(0);
      setCount(0);
    } else {
      setCounter((prevCounter) => prevCounter + 1);
      setCount(0);
    }
  }

  function back() {
    if (counter <= 0) {
      setCounter(azkarData.length - 1);
      setCount(0);
    } else {
      setCounter((prevCounter) => prevCounter - 1);
      setCount(0);
    }
  }

  return (
    <div className="bg-white w-[400px] h-[400px] flex flex-col justify-between rounded-lg shadow-xl">
      <div className="py-4 font-serif font-bold text-2xl islam bg-cover">
        <h1 className="text-[#024c46]">أذكار الصباح</h1>
      </div>
      <div className="flex-1 pt-10 px-4 font-arabic ">
        <p>{azkarData[counter].data}</p>
      </div>
      <div className="my-4">
        <button
          onClick={num}
          className="bg-[#024c46] rounded-full text-white w-10 h-10"
        >
          {count}
        </button>
      </div>
      <div className="flex px-4 justify-between my-4">
        {" "}
        <div>
          {" "}
          <button
            onClick={back}
            className={` place-self-start font-serif font-bold ${
              counter <= 0 ? "hidden" : ""
            }`}
          >
            السابق
          </button>
        </div>
        <div>
          {" "}
          <button
            onClick={next}
            className={` place-self-end font-serif font-bold ${
              counter >= azkarData.length - 1 ? "hidden" : ""
            }`}
          >
            التالى
          </button>
        </div>
      </div>
    </div>
  );
}

export default Azkar;
